use labor_sql;
/*
БД «Фірма прий. вторсировини». Вивести інформацію про
видачу грошей на суму понад 2000 грн. на пунктах прийому
таблиці Outcome_o. Вихідні дані впорядкувати за спаданням за
стовпцем date.
*/
select * from outcome_o
where `out` > 2000
order by date desc;

/*
БД «Фірма прий. вторсировини». Вивести інформацію про
прийом грошей на суму у межах від 5 тис. до 10 тис. грн. на
пунктах прийому таблиці Income_o. Вихідні дані впорядкувати
за зростанням за стовпцем inc.
*/
select * from income_o
where inc >= 5000 and inc <= 10000
order by inc;

/*
БД «Фірма прий. вторсировини». Вивести інформацію про
прийом грошей на пункті прийому No1 таблиці Income. Вихідні
дані впорядкувати за зростанням за стовпцем inc.
*/
select * from income
where `point` = 1
order by inc; 

/*
БД «Фірма прий. вторсировини». Вивести інформацію про
видачу грошей на пункті прийому No2 таблиці Outcome.
Вихідні дані впорядкувати за зростанням за стовпцем out.
*/
select * from outcome
where `point` = 2
order by `out`; 


