use labor_sql;
-- 10 (Об’єднання UNION)
/*1. БД «Комп. фірма». Знайдіть номера моделей та ціни усіх
продуктів (будь-якого типу), що випущені виробником 'B'.
Вивести: maker, model, type, price. (Підказка: використовувати
оператор UNION)*/
select maker, model, type from product
where maker = 'B'
union
select 'B', model,  price from laptop
union
select 'B', model, price from pc
union
select 'B',model, price from printer;

/*2. БД «Комп. фірма». Для кожної моделі продукції з усієї БД
виведіть її найвищу ціну. Вивести: type, model, максимальна
ціна. (Підказка: використовувати оператор UNION)*/    
select  type, model from product
union 
select model, max(price) from laptop;

/*3. БД «Комп. фірма». Знайдіть середню ціну ПК та ноутбуків, що
випущені виробником 'A'. Вивести: одна загальна середня ціна.
(Підказка: використовувати оператор UNION)*/

/*4. БД «Кораблі». Перерахуйте назви головних кораблів, що є
наявними у БД (врахувати також і кораблі з таблиці
Outcomes). Вивести: назва корабля, class. (Підказка:
використовувати оператор UNION та операцію EXISTS)*/

/*5. БД «Кораблі». Знайдіть класи, у яких входить лише один
корабель з усієї БД (врахувати також кораблі у таблиці
Outcomes, яких немає у таблиці Ships). Вивести: class.
(Підказка: використовувати оператор UNION та операцію
EXISTS)*/

/*6. БД «Кораблі». Для кожного класу порахувати кількість
кораблів, що входить до нього (врахувати також кораблі у
таблиці Outcomes, яких немає у таблиці Ships). Вивести: class,
кількість кораблів у класі. (Підказка: використовувати
оператор UNION та операцію EXISTS)*/

/*7. БД «Кораблі». Знайдіть класи, в які входять лише один або два
кораблі з цілої БД (врахувати також кораблі у таблиці
Outcomes, яких немає у таблиці Ships). Вивести: class,
кількість кораблів у класі. (Підказка: використовувати
оператор UNION та операцію EXISTS)*/

/*8. БД «Кораблі». Знайдіть назви усіх кораблів з БД, про які
можна однозначно сказати, що вони були спущені на воду до
1942 р. Вивести: назву кораблів. (Підказка: використовувати
оператор UNION )*/
