use labor_sql;
/*1.БД «Комп. фірма». Знайдіть виробників, що випускають ПК,
але не ноутбуки (використати операцію IN). Вивести maker.*/
-- select maker from (select maker from product p1
-- where model in (select model from pc p1))
-- where not exists (select maker from product p2
-- where model in (select model from laptop l1) );

/*2.БД «Комп. фірма». Знайдіть виробників, що випускають ПК,
але не ноутбуки (використати ключове слово ALL). Вивести
maker.*/
select distinct maker from product
where model != All (select model from laptop) and model = All (select model from pc);

/*3.БД «Комп. фірма». Знайдіть виробників, що випускають ПК,
але не ноутбуки (використати ключове слово ANY). Вивести
maker.*/

/*4.БД «Комп. фірма». Знайдіть виробників, що випускають
одночасно ПК та ноутбуки (використати операцію IN).
Вивести maker.*/
select maker, model from product
where model in(select model from pc) ;

/*5.БД «Комп. фірма». Знайдіть виробників, що випускають
одночасно ПК та ноутбуки (використати ключове слово ALL).
Вивести maker.*/

/*6. БД «Комп. фірма». Знайдіть виробників, що випускають
одночасно ПК та ноутбуки (використати ключове слово ANY).
Вивести maker.*/

/*7. БД «Комп. фірма». Знайти тих виробників ПК, усі моделі ПК
яких є у наявності в таблиці PC (використовувати вкладені
підзапити та оператори IN, ALL, ANY). Вивести maker.*/

/*8. БД «Кораблі». Вивести класи усіх кораблів України ('Ukraine').
Якщо у БД немає класів кораблів України, тоді вивести класи
для усіх наявних у БД країн. Вивести: country, class.*/

/*9. БД «Кораблі». Знайдіть кораблі, «збережені для майбутніх
битв», тобто такі, що були виведені з ладу в одній битві
('damaged'), а потім (пізніше у часі) знову брали участь у
битвах. Вивести: ship, battle, date.*/

/*10. БД «Комп. фірма». Знайти наявну кількість комп’ютерів, що
випущені виробником 'A'.*/

/*11. БД «Комп. фірма». Знайти виробників ПК, моделей яких немає
у продажу (тобто відсутні у таблиці PC).*/

/*12. БД «Комп. фірма». Знайти моделі та ціни ноутбуків, вартість
яких є вищою за вартість будь-якого ПК. Вивести: model, price.*/
