use labor_sql;
-- 7 (Статистичні функції та робота з групами)

/*1. БД «Комп. фірма». Знайдіть принтери, що мають найвищу
ціну. Вивести: model, price.*/
select model, price from printer
where price in (
	select max(price) from printer
);


/*2. БД «Комп. фірма». Знайдіть ноутбуки, швидкість яких є
меншою за швидкість будь-якого з ПК. Вивести: type, model,
speed.*/
select  model, speed from laptop
where speed < any (
	select speed from pc
);

/*3. БД «Комп. фірма». Знайдіть виробників найдешевших
кольорових принтерів. Вивести: maker, price.*/
select maker from product 
where model in (
	select model from printer p1 
    where price in (
		select min(price) from printer p2
		where   color = 'y'
    )
);

/*4. БД «Комп. фірма». Знайдіть виробників, що випускають по
крайній мірі дві різні моделі ПК. Вивести: maker, число
моделей. (Підказка: використовувати підзапити у якості
обчислювальних стовпців та операцію групування)*/


/*5. БД «Комп. фірма». Знайдіть середній розмір жорсткого диску
ПК (одне значення на всіх) тих виробників, які також
випускають і принтери. Вивести: середній розмір жорсткого
диску.*/

/*6. БД «Аеропорт». Визначіть кількість рейсів з міста 'London' для
кожної дати таблиці Pass_in_trip. Вивести: date, число рейсів.*/

/*7. БД «Аеропорт». Визначіть дні, коли було виконано
максимальну кількість рейсів до міста 'Moscow'. Вивести: date,
число рейсів.*/

/*8. БД «Кораблі». Для кожної країни визначити рік, у якому було
спущено на воду максимальна кількість її кораблів. У випадку,
якщо виявиться декілька таких років, тоді взяти мінімальний з
них. Вивести: country, кількість кораблів, рік.*/

/*9. БД «Кораблі». Вкажіть битви, у яких брало участь по крайній
мірі два корабля однієї і тієї ж країни (Вибір країни
здійснювати через таблицю Ships, а назви кораблів для таблиці
Outcomes, що відсутні у таблиці Ships, не брати до уваги).
Вивести: назву битви, країну, кількість кораблів.*/

