use labor_sql;
-- 8 (Підзапити у якості обчислювальних стовпців)
 
/*1. БД «Комп. фірма». Для таблиці Product отримати підсумковий
набір у вигляді таблиці зі стовпцями maker, pc, laptop та printer,
в якій для кожного виробника необхідно вказати кількість
продукції, що ним випускається, тобто наявну загальну
кількість продукції у таблицях, відповідно, PC, Laptop та
Printer. (Підказка: використовувати підзапити у якості
обчислювальних стовпців)*/

/*2. БД «Комп. фірма». Для кожного виробника знайдіть середній
розмір екрану для ноутбуків, що ним випускається. Вивести:
maker, середній розмір екрану. (Підказка: використовувати
підзапити у якості обчислювальних стовпців)*/

/*3. БД «Комп. фірма». Знайдіть максимальну ціну ПК, що
випускаються кожним виробником. Вивести: maker,
максимальна ціна. (Підказка: використовувати підзапити у
якості обчислювальних стовпців)*/

/*4. БД «Комп. фірма». Знайдіть мінімальну ціну ПК, що
випускаються кожним виробником. Вивести: maker,
максимальна ціна. (Підказка: використовувати підзапити у
якості обчислювальних стовпців)*/

/*5. БД «Комп. фірма». Для кожного значення швидкості ПК, що
перевищує 600 МГц, визначіть середню ціну ПК з такою ж
швидкістю. Вивести: speed, середня ціна. (Підказка:
використовувати підзапити у якості обчислювальних
стовпців)*/

/*6. БД «Комп. фірма». Знайдіть середній розмір жорсткого диску
ПК кожного з тих виробників, які випускають також і
принтери. Вивести: maker, середній розмір жорсткого диску.
(Підказка: використовувати підзапити у якості
обчислювальних стовпців)*/

/*7. БД «Кораблі». Вкажіть назву, водотоннажність та число
гармат кораблів, що брали участь у битві при 'Guadalcanal'.
Вивести: ship, displacement, numGuns. (Підказка:
використовувати підзапити у якості обчислювальних
стовпців)*/

/*8. БД «Кораблі». Вкажіть назву, країну та число гармат кораблів,
що були пошкоджені у битвах. Вивести: ship, country,
numGuns. (Підказка: використовувати підзапити у якості
обчислювальних стовпців)*/
